Пансион83/src/Documents/Задача/Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задача</name>
  <registerRecords>InformationRegister.ИсторияЗадач</registerRecords>
  <attributes>
    <name>ParentDoc</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>MessageStatus</name>
    <type>
      <types>CatalogRef.СтатусЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>MessageType</name>
    <type>
      <types>CatalogRef.ТипыСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidFromDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidToDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ForEmployee</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ForDepartment</name>
    <type>
      <types>CatalogRef.Отделы</types>
    </type>
  </attributes>
  <attributes>
    <name>IsClosed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PopUp</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>CloseToDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ClosedBy</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>DateWhenClosed</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Color</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>SendBySMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SMSIsSent</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>B24TaskID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Comments</name>
    <attributes>
      <name>Period</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Employee</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>MessageStatus</name>
      <type>
        <types>CatalogRef.СтатусЗадачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Comments</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Пансион83/src/Documents/Задача/ObjectModule.bsl
//-----------------------------------------------------------------------------
Процедура Posting(pCancel, pMode)
	// Fill employee that closed message and date and time when it was closed
	If IsClosed And НЕ ЗначениеЗаполнено(DateWhenClosed) Тогда
		DateWhenClosed = CurrentDate();
		ClosedBy = ПараметрыСеанса.ТекПользователь;
		ThisObject.Write(DocumentWriteMode.Write);
	ElsIf НЕ IsClosed And ЗначениеЗаполнено(DateWhenClosed) Тогда
		DateWhenClosed = Неопределено;
		ClosedBy = Справочники.Сотрудники.EmptyRef();
		ThisObject.Write(DocumentWriteMode.Write);
	EndIf;
	
	// Clear register records
	RegisterRecords.Задачи.Clear();
	
	// Build list of accounting dates
	vDates = New СписокЗначений();
	If НЕ ЗначениеЗаполнено(ValidFromDate) And НЕ ЗначениеЗаполнено(ValidToDate) Тогда
		vDates.Add('00010101');
	ElsIf ЗначениеЗаполнено(ValidFromDate) And НЕ ЗначениеЗаполнено(ValidToDate) Тогда
		vDates.Add(BegOfDay(ValidFromDate));
	Else
		vDay = BegOfDay(Date);
		If ЗначениеЗаполнено(ValidFromDate) Тогда
			vDay = BegOfDay(ValidFromDate);
		EndIf;
		vEnd = BegOfDay(ValidToDate);
		While vDay <= vEnd Do
			vDates.Add(vDay);
			vDay = vDay + 24*3600;
		EndDo;
	EndIf;
	
	// Do for each day in message period
	For Each vDatesItem In vDates Do
		vAccountingDate = vDatesItem.Value;
		
		// Post to messages register
		Record = RegisterRecords.Задачи.Add();
		
		Record.УчетнаяДата = vAccountingDate;
		Record.Period = Date;
		Record.ДокОснование = ParentDoc;
		//Record.Object = ByObject;
		Record.ValidFromDate = ValidFromDate;
		Record.ValidToDate = ValidToDate;
		Record.CloseToDate = CloseToDate;
		Record.Примечания = Remarks;
		Record.ForEmployee = ForEmployee;
		Record.ForDepartment = ForDepartment;
		Record.IsClosed = IsClosed;
		Record.PopUp = PopUp;
		Record.Автор = Автор;
		Record.ClosedBy = ClosedBy;
		Record.DateWhenClosed = DateWhenClosed;
		Record.MessageType = MessageType;
		Record.MessageStatus = MessageStatus;
		Record.Color = Color;
		Record.B24TaskID = B24TaskID;
	EndDo;

	// Write register records
	RegisterRecords.Задачи.Write();
КонецПроцедуры //Posting

//-----------------------------------------------------------------------------
Function CheckDocumentAttributes(pMessage, pAttributeInErr) Экспорт
	vHasErrors = False;
	pMessage = "";
	pAttributeInErr = "";
	vMsgTextRu = "";
	vMsgTextEn = "";
	vMsgTextDe = "";
	If НЕ ЗначениеЗаполнено(Remarks) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Текст сообщения> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Примечания> attribute should be filled!" + Chars.LF;
		vMsgTextDe = vMsgTextDe + "<Примечания> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Примечания", pAttributeInErr);
	EndIf;
	If vHasErrors Тогда
		pMessage = "ru='" + TrimAll(vMsgTextRu) + "';" + "en='" + TrimAll(vMsgTextEn) + "';" + "de='" + TrimAll(vMsgTextDe) + "';";
	EndIf;
	Return vHasErrors;
EndFunction //CheckDocumentAttributes

//-----------------------------------------------------------------------------
Процедура pmFillAuthorAndDate() Экспорт
	Date = CurrentDate();
	Автор = ПараметрыСеанса.ТекПользователь;
КонецПроцедуры //pmFillAuthorAndDate

//-----------------------------------------------------------------------------
Процедура pmFillAttributesWithDefaultValues() Экспорт
	// Fill author and document date
	pmFillAuthorAndDate();
	// Fill message status
	If НЕ ЗначениеЗаполнено(MessageStatus) Тогда
		If ЗначениеЗаполнено(ПараметрыСеанса.ТекущаяГостиница) Тогда
			MessageStatus = ПараметрыСеанса.ТекущаяГостиница.MessageStatus;
		EndIf;
	EndIf;
КонецПроцедуры //pmFillAttributesWithDefaultValues

//-----------------------------------------------------------------------------
Процедура OnSetNewNumber(pStandardProcessing, pPrefix)
	vPrefix = "";
	If ЗначениеЗаполнено(ПараметрыСеанса.ТекущаяГостиница) Тогда
		vPrefix = TrimAll(ПараметрыСеанса.ТекущаяГостиница.GetObject().pmGetPrefix());
	EndIf;
	If vPrefix <> "" Тогда
		pPrefix = vPrefix;
	EndIf;
КонецПроцедуры //OnSetNewNumber

//-----------------------------------------------------------------------------
Процедура pmAddComment(pCommentText = "") Экспорт
	vCommentRow = Comments.Add();
	vCommentRow.Period = CurrentDate();
	vCommentRow.Employee = ПараметрыСеанса.ТекПользователь;
	vCommentRow.MessageStatus = MessageStatus;
	vCommentRow.Comments = TrimR(pCommentText);
КонецПроцедуры //pmAddComment

//-----------------------------------------------------------------------------
Процедура OnCopy(pCopiedObject)
	If ЗначениеЗаполнено(ПараметрыСеанса.ТекущаяГостиница) And ЗначениеЗаполнено(ПараметрыСеанса.ТекущаяГостиница.MessageStatus) Тогда
		MessageStatus = ПараметрыСеанса.ТекущаяГостиница.MessageStatus;
	EndIf;
	IsClosed = False;
	ClosedBy = Неопределено;
	DateWhenClosed = Неопределено;
КонецПроцедуры //OnCopy
